In [71]:
import pandas as pd
url = "https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-05-05/villagers.csv"
df = pd.read_csv(url)
df.isna().sum()
# Question 1 #

row_n           0
id              1
name            0
gender          0
species         0
birthday        0
personality     0
song           11
phrase          0
full_id         0
url             0
dtype: int64

In [21]:
print(f'Number of rows: {df.shape[0]}')
print(f'Number of columns: {df.shape[1]}')
# Question 2 #

Number of rows: 391
Number of columns: 11

In [ ]:
#An observation is a row in a dataset that represents different data for a particular record point, such as an athlete's performance, height, weight, etc.
#A variable is a column in the dataset that is a type of direct observation, e.g., grades, height, weight, etc.
# Question 2 #

In [39]:
df.describe(include='all')
# Question 3 #

,row_n,id,name,gender,species,birthday,personality,song,phrase,full_id,url
count,391.000000,390,391,391,391,391,391,380,391,391,391
unique,NaN,390,391,2,35,361,8,92,388,391,391
top,NaN,admiral,Admiral,male,cat,1-27,lazy,K.K. Country,wee one,villager-admiral,https://villagerdb.com/images/villagers/thumb/...
freq,NaN,1,1,204,23,2,60,10,2,1,1
mean,239.902813,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,140.702672,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,2.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,117.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,240.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,363.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,483.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
url2 = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv"
df2 = pd.read_csv(url2)
df2.describe()
# Question 4 #

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [37]:
df2.shape
# Question 4 #

(891, 15)

In [36]:
# the discrepancy arises because df.shape counts all columns (both numerical and categorical), while df.describe() only analyzes numerical columns unless explicitly told otherwise.#
# The "count" column in df.describe() indicates how many non-null values are present in each column. If some columns have missing data (null values), the "count" reported by df.describe() will be less than the total number of rows shown by df.shape.#
# Question 4 #

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Attributes are the data of the object itself, and only need to be read, without the need for other functions, such as arithmetic and so on. Therefore no () is needed.#
# Methods, on the other hand, involve new operations on the object and create new data, such as calling the object to perform arithmetic, etc., so they need () to accept possible arguments.#
# Question 5 #

In [ ]:
# count: The number of non-missing (non-null) values in the column.#
# mean: The average of the values in the column, calculated as the sum of all values divided by the count.#
# std: A measure of the spread or dispersion of the data. It indicates how much the values in a column deviate from the mean on average.#
# min: The minimum value in the column.#
# 25%: The value below which 25% of the data falls. This is also known as the first quartile (Q1) and represents the lower 25% of the data.#
# 50%: The median value, meaning 50% of the data is below this value, and 50% is above. It’s also known as the second quartile (Q2).#
# 75%: The value below which 75% of the data falls. This is the third quartile (Q3), representing the upper 25% of the data.#
# max: The maximum value in the column.#
# Question 6 #

In [73]:
# 1. df.dropna() removes rows with missing data, so if if most of the dataset has complete rows and only a few rows contain multiple columns of missing data, then using df.dropna() takes precedence over del df['col'] #
# 2. del df['col'] deletes entire columns. So if one or more columns have a large number of missing values and are not useful for analysis, then this is the time to choose to delete an entire column, then using del df['col'] takes precedence over df.dropna().#
# 3. df.dropna() will remove rows based on missing data in all columns, which means that if there is a column with a lot of missing data, but all other columns are complete, then df.dropna() will still remove a large number of rows, resulting in important data being removed. Therefore it is important to use del df['col'] in advance to delete columns with a lot of missing data.#
# Question 7 #

In [85]:
print(df.isna().sum())
# Question 7 #

row_n          0
id             1
name           0
gender         0
species        0
birthday       0
personality    0
phrase         0
full_id        0
url            0
dtype: int64

In [76]:
del df["song"]
# Question 7 #

In [83]:
df.dropna()
print(df.dropna().isna().sum())
# Question 7 #

row_n          0
id             0
name           0
gender         0
species        0
birthday       0
personality    0
phrase         0
full_id        0
url            0
dtype: int64

In [96]:
df2.groupby("sex")["age"].describe()
# df.groupby(“sex”) groups each unique value in the “sex” column in the dataset, and “sex” has “male” and “female”. There are two values for “male” and “female”, so there are two groups.#
# .describe generates statistics on the values in the group, including counts, means, standard deviations, minimums, maximums, and quartiles.#
# df.groupby(“sex”).describe generates the “male” and “female” group in all the columns of the value of statistics, such as age, parch and so on.#
# If I want to generate statistics for a particular column, such as the “male” group and the “female” group in the “age” column, use df2.groupby(“sex”)[” age"].describe().#
# Question 8 #

        count       mean        std   min   25%   50%   75%   max
sex
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

In [ ]:
# In df.describe(), missing values are listed overall, regardless of the distribution of those values, e.g., whether they are maxima, minima, and so on.#
# Whereas in df.groupby(“col1”)[“col2”].describe(), missing values are handled separately within each group, so the counts may vary depending on the distribution of non-null values within the group. For example, if the maximum, minimum, std, 25%, 50%, and 75% of the values in the group are not missing values, then the missing values will not be listed.#
# Question 8 #

In [97]:
# (a) it's easier to (a) work in a ChatBot session to fix the errors#
# Because these basic errors can be easily fixed with ChatBot, using Google to find them instead will take more time.#
# Question 8 #

NameError: name 'Df2' is not defined

In [ ]:
# YES #
# Question 9 #

In [ ]:
# Summary 1#
#Dataset Overview:
#Dataset: You explored the Villagers dataset and needed guidance on handling missing data.

#Attributes vs. Methods:
#Attributes (e.g., df.shape): Show data or properties, no parentheses needed.
#Methods (e.g., df.describe()): Perform actions on data, require parentheses.

#Descriptive Statistics:
#count: Number of non-missing values.
#mean: Average value.
#std: Spread of data (standard deviation).
#min: Minimum value.
#25%, 50%, 75%: Quartiles (25th, median, 75th percentiles).
#max: Maximum value.

#Handling Missing Data:
#df.dropna(): Removes rows with missing data.
#del df['col']: Deletes columns with excessive missing values.
#Order: Delete columns with lots of missing data first, then drop rows to keep more useful data.

# Summary 2#
#Titanic Dataset Analysis:
#You’re analyzing the Titanic dataset and asked for help understanding code and analysis.

#Code Explanation:
#df.groupby("col1")["col2"].describe(): Groups data by "col1" and describes statistics for "col2" within each group.

#Error Handling:
#KeyError with "sex": Likely due to the column not existing. Check column names and data loading.

#Counts Difference:
#df.describe(): Shows non-null counts for each column across the entire DataFrame.
#df.groupby("col1")["col2"].describe(): Shows non-null counts for "col2" within each group of "col1

# Summary 3#
#Handling Import Errors: We addressed the NameError: name 'pd' is not defined error, which occurs when the pandas library isn't imported with the alias pd. The solution is to import pandas using import pandas as pd.

#File Not Found Error: We discussed how to resolve the [Errno 2] No such file or directory: 'titanics.csv' error, which is due to the file being missing or incorrectly named. Ensure the file name is correct (e.g., titanic.csv), provide the correct path, and verify the file's existence.

#Variable Not Defined Error: We tackled the NameError: name 'Df' is not defined issue, which arises from using an undefined variable or a typo. The solution involves using the correct variable name, df, and ensuring consistency in your code.

In [ ]:
#ChatGPT histories:
#https://chatgpt.com/share/66e34fd3-8f68-800b-acf5-de6fb20f88e9
#https://chatgpt.com/share/66e34fe7-a6e4-800b-8413-1bfbcceb5853
#https://chatgpt.com/share/66e34f4c-4968-800b-869c-89a4b8f6c203